---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.TotalDepth
source: html/00e10880-4a18-381a-44fb-51dd1ba226b8.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.TotalDepth Property

The total depth of the stairs run, only available for monolithic stairs run.

## Syntax (C#)
```csharp
public double TotalDepth { get; }
```